# JournalingAttribute Class

---
The custom journaling attribute to control the journaling behavior of the external command.
SystemObject SystemAttribute Autodesk.Revit.AttributesJournalingAttribute
**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class JournalingAttribute : Attribute

    Public Class JournalingAttribute
    	Inherits Attribute

    public ref class JournalingAttribute : public Attribute

    type JournalingAttribute =
        class
            inherit Attribute
        end
The JournalingAttribute type exposes the following members.
| Name| Description
---|---|---
| JournalingAttribute| Constructs a new JournalingAttribute.
Top
| Name| Description
---|---|---
| Mode| Journaling mode.
| TypeId| When implemented in a derived class, gets a unique identifier for this Attribute.(Inherited from Attribute)
Top
| Name| Description
---|---|---
| Equals| Returns a value that indicates whether this instance is equal to a specified object.(Inherited from Attribute)
| GetHashCode| Returns the hash code for this instance.(Inherited from Attribute)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsDefaultAttribute| When overridden in a derived class, indicates whether the value of this instance is the default value for the derived class.(Inherited from Attribute)
| Match| When overridden in a derived class, returns a value that indicates whether this instance equals a specified object.(Inherited from Attribute)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.Attributes Namespace